src/test/resources/requests/charge_1.json

{
      "AccountID":"1234567890",
      "Amount":"25.00",
      "Attributes":{
        "Email":"test@trustly.com",
        "ShopperStatement":"Trustly"
      },
      "Currency":"SEK",
      "EndUserID":12345,
      "MessageID":"your_unique_deposit_id",
      "NotificationURL":"https://URL_to_your_notification_service",
      "Password":"merchant_password",
      "Username":"merchant_username"
    }
