src/test/resources/responses/accountledger.json

{
  "version": "1.1",
  "result": {
    "signature": "lCteM8iCg++7uyF...TYoY/mc7eUQ6FWNPg==",
    "method": "AccountLedger",
    "data": [{
      "userid": "3839426635",
      "datestamp": "2014-01-30 13:28:45.652299+01",
      "orderid": "3209647863",
      "accountname": "SUSPENSE_ACCOUNT_CLIENT_FUNDS_SWEDEN_ESSE",
      "messageid": "133921",
      "transactiontype": "User deposit of client funds to CLIENT_FUNDS_SWEDEN_ESSE",
      "currency": "EUR",
      "amount": "5.00000000000000000000",
      "gluepayid": "3209647863"
    }, {
      "accountname": "TRANSACTION_FEE_BANK_DEPOSIT",
      "orderid": "3209647863",
      "userid": "3839426635",
      "datestamp": "2014-01-30 13:28:45.652299+01",
      "messageid": "133921",
      "transactiontype": "User deposit of client funds to CLIENT_FUNDS_SWEDEN_ESSE",
      "currency": "SEK",
      "amount": "-3.01",
      "gluepayid": "3209647863"
    }],
    "uuid": "11111111-1111-1111-1111-111111111111"
  }
}
